// pages/about/log/log.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    logData: [{
      version: "v2.0.6",
      data: "2022/12/09",
      info: ["1.用户列表UI模板+2", "2.评论页UI模板+2", "3.新增瀑布流样式", "4.新增背景色样式", "5.轮播图样式+1", "6.部分样式调整"]
    }, {
      version: "v2.0.5",
      data: "2022/11/27",
      info: ["1.首页UI模板+2", "2.个人中心UI模板+2", "3.部分样式更新"]
    }, {
      version: "v2.0.4",
      data: "2022/10/24",
      info: ["1.优化darkmodel样式", "2.新增背景浅色渐变高亮样式", "3.部分样式更新"]
    }, {
      version: "v2.0.3",
      data: "2022/10/18",
      info: ["1.去除模板页", "2.新增黑色模式", "3.部分样式更新"]
    }, {
      version: "v2.0.2",
      data: "2022/10/16",
      info: ["1.新增模板页、关于页", "2.去除悬浮按钮，新增关于页面", "3.新增日志更新页面", "4.代码开源"]
    }, {
      version: "v2.0.1",
      data: "2022/10/14",
      info: ["1.ColorUI 2.0基础代码结构重构", "2.临时修复swiper左侧消失bug", "3.基础页面开发"]
    }, ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})